#+BEGIN_COMMENT
.. title: Parts-of-Speech Tagging: The Data
.. slug: parts-of-speech-tagging-the-data
.. date: 2020-11-15 16:18:03 UTC-08:00
.. tags: nlp,pos tagging
.. category: NLP
.. link: 
.. description: Loading the Wall Street Journal POS data.
.. type: text

#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 3

#+PROPERTY: header-args :session ~/.local/share/jupyter/runtime/kernel-6f7a1dc1-2226-4c47-9731-6e45efa2b7b4-ssh.json

#+BEGIN_SRC python :results none :exports none
%load_ext autoreload
%autoreload 2
#+END_SRC
** The Training Corpus
   The training corpus is made up of words and parts-of-speech tags from the Wall Street Journal (previously looked at in {{% lancelot title="this post" %}}parts-of-speech-tagging-creating-a-vocabulary{{% /lancelot %}}).
#+begin_src python :results none
with open(os.environ[Environment.training_corpus]) as reader:
    training_corpus = reader.read().split("\n")
#+end_src

#+begin_src python :results output :exports both
for row in training_corpus[:5]:
    print(f" - {row}")
#+end_src

#+RESULTS:
:  - In	IN
:  - an	DT
:  - Oct.	NNP
:  - 19	CD
:  - review	NN

** The Vocabulary
There is also a pre-processed version of that same file that has only the words without the parts-of-speech tags that we can load. It has been altered slightly as well:
 - Words that appear only once have been removed
 - Words that don't exist in the original have been added so that there are some unknown words to handle.
#+begin_src python :results output :exports both
with open(os.environ[Environment.vocabulary]) as reader:
    vocabulary_words = reader.read().split("\n")

for row in vocabulary_words[:5]:
    print(f" - {row}")
#+end_src

#+RESULTS:
:  - !
:  - #
:  - $
:  - %
:  - &

Odd.

#+begin_src python :results output :exports both
for row in random.sample(vocabulary_words, 5):
    print(f" - {row}")
#+end_src

#+RESULTS:
:  - cabinet
:  - Byrd
:  - done
:  - Fueling
:  - investments

Our actual vocabulary is going to be a dictionary mapping each word to its index in the list we just loaded.

#+begin_src python :results none
vocabulary_words = sorted(vocabulary_words)
vocabulary = {key: index for index, key in enumerate(vocabulary_words)}
assert len(vocabulary) == len(vocabulary_words)
#+end_src

#+begin_src python :results output :exports both
training_counter = Counter([row.split("\t")[0] for row in training_corpus])
filtered = set(key for key, value in training_counter.items() if value > 1)
extra = set(vocabulary) - filtered
print(f"{len(extra):,}")
for item in random.sample(extra, 5):
    print(f" - {item}")
#+end_src

#+RESULTS:
: 9
:  - --unk_adj--
:  - --n--
:  - --unk--
:  - --unk_noun--
:  - --unk_adv--

So, it looks like the "unknowns" are pre-process tags.
*** Load the Test Words
#+begin_src python :results output :exports both
with open(os.environ[Environment.test_words]) as reader:
    test_words = reader.read().strip()
before = len(test_words)
test_words = preprocess(test_words, vocabulary)
assert len(test_words) == before

print(f"{len(test_words):,}")
for word in random.sample(test_words, 5):
    print(f" - {word}")
#+end_src

#+RESULTS:
: 180,264
:  - --unknown--
:  - --n--
:  - e
:  - r
:  - --unknown--

Weird that the letters "e" and "r" are known words...
** Test it Out
#+begin_src python :results none
from neurotic.nlp.parts_of_speech.preprocessing import Environment, DataLoader

loader = DataLoader()
#+end_src

#+begin_src python :results none
for theirs, mine in zip(vocabulary_words, loader.vocabulary_words):
    assert theirs == mine
#+end_src

#+begin_src python :results none
for theirs, mine in zip(vocabulary, loader.vocabulary):
    assert vocabulary[theirs] == loader.vocabulary[mine]
#+end_src

#+begin_src python :results output :exports both
loader = DataLoader(Environment)

print(f"{len(loader.vocabulary_words):,}")
print(random.sample(loader.vocabulary_words, 2))
assert len(loader.vocabulary_words) == len(vocabulary_words)

print(f"\n{len(loader.training_corpus):,}")
assert (len(loader.training_corpus)) == len(training_corpus)
print(random.sample(loader.training_corpus, 2))

print(f"\n{len(loader.vocabulary):,}")
assert len(loader.vocabulary) == len(vocabulary)

print(f"\n{len(loader.test_corpus):,}")
assert len(loader.test_corpus) == len(test_corpus)
print(random.sample(loader.test_corpus, 2))


print(f"\n{len(loader.test_words):,}")
print(random.sample(loader.test_words, 2))
#+end_src

#+RESULTS:
#+begin_example
23,777
['Island', 'Gibbons']

989,861
['nine\tCD', 'in\tIN']

23,777

34,200
['at\tIN', 'to\tTO']

34,200
['the', ';']
#+end_example

*** The Preprocessed Test Words
#+begin_src python :results output :exports both
original, prep = preprocess(vocab, os.environ[Environment.test_words])

index = 0
for theirs, mine in zip(prep, loader.test_words):
    if THEIRS_TO_MINE.get(theirs, theirs) != mine:
        token = original[index]
        print(index, theirs, mine, token, assign_unk(token))
    index += 1
#+end_src

#+RESULTS:
#+begin_example
9 --unk-- --unknown-noun-- vantage --unk_noun--
228 --unk-- --unknown-verb-- exacerbate --unk_verb--
845 --unk-- --unknown-adjective-- relentless --unk_adj--
896 --unk-- --unknown-adjective-- slickly --unk_adj--
906 --unk-- --unknown-adjective-- cognoscenti --unk_adj--
919 --unk-- --unknown-noun-- depiction --unk_noun--
1076 --unk-- --unknown-adjective-- perfidious --unk_adj--
1160 --unk-- --unknown-adjective-- innocently --unk_adj--
1196 --unk-- --unknown-adjective-- loutish --unk_adj--
1244 --unk-- --unknown-verb-- premise --unk_verb--
1268 --unk-- --unknown-adjective-- conspicuously --unk_adj--
1331 --unk-- --unknown-noun-- ignition --unk_noun--
1347 --unk-- --unknown-noun-- obligatory --unk_noun--
1448 --unk-- --unknown-adjective-- lavishly --unk_adj--
1468 --unk-- --unknown-adjective-- palatable --unk_adj--
1564 --unk-- --unknown-adjective-- inconsiderable --unk_adj--
1678 --unk-- --unknown-adjective-- discreetly --unk_adj--
1774 --unk-- --unknown-adjective-- marvelously --unk_adj--
1855 --unk-- --unknown-adjective-- passable --unk_adj--
1970 --unk-- --unknown-noun-- diaper --unk_noun--
3248 --unk-- --unknown-adjective-- comparably --unk_adj--
3672 --unk-- --unknown-noun-- imperialism --unk_noun--
3791 --unk-- --unknown-noun-- livelier --unk_noun--
3793 --unk-- --unknown-noun-- bolder --unk_noun--
4132 --unk-- --unknown-noun-- intimidation --unk_noun--
4648 --unk-- --unknown-adjective-- politic --unk_adj--
4661 --unk-- --unknown-verb-- mutate --unk_verb--
4682 --unk-- --unknown-noun-- aspersion --unk_noun--
4777 --unk-- --unknown-adjective-- utopian --unk_adj--
4802 --unk-- --unknown-adjective-- psychic --unk_adj--
4892 --unk-- --unknown-noun-- coercion --unk_noun--
5043 --unk-- --unknown-noun-- centrist --unk_noun--
5090 --unk-- --unknown-noun-- schooling --unk_noun--
5131 --unk-- --unknown-noun-- voucher --unk_noun--
5270 --unk-- --unknown-noun-- recruitment --unk_noun--
5316 --unk-- --unknown-noun-- expansionism --unk_noun--
5429 --unk-- --unknown-verb-- palate --unk_verb--
5440 --unk-- --unknown-noun-- engorgement --unk_noun--
5557 --unk-- --unknown-noun-- patronage --unk_noun--
5912 --unk-- --unknown-noun-- volunteerism --unk_noun--
5990 --unk-- --unknown-adjective-- utopian --unk_adj--
6709 --unk-- --unknown-noun-- citizenship --unk_noun--
6738 --unk-- --unknown-noun-- abomination --unk_noun--
6793 --unk-- --unknown-adjective-- reflexively --unk_adj--
6809 --unk-- --unknown-noun-- regimentation --unk_noun--
6876 --unk-- --unknown-noun-- compulsory --unk_noun--
7150 --unk-- --unknown-adjective-- arguably --unk_adj--
7192 --unk-- --unknown-noun-- compulsion --unk_noun--
7208 --unk-- --unknown-adjective-- unenforceable --unk_adj--
7374 --unk-- --unknown-noun-- recruitment --unk_noun--
7468 --unk-- --unknown-adjective-- challengeable --unk_adj--
7591 --unk-- --unknown-adjective-- unprecedentedly --unk_adj--
7657 --unk-- --unknown-adjective-- cooperatively --unk_adj--
8182 --unk-- --unknown-noun-- reticence --unk_noun--
8772 --unk-- --unknown-noun-- render --unk_noun--
11071 --unk-- --unknown-noun-- breather --unk_noun--
11942 --unk-- --unknown-verb-- unify --unk_verb--
12859 --unk-- --unknown-verb-- frigate --unk_verb--
12907 --unk-- --unknown-noun-- disarmament --unk_noun--
12936 --unk-- --unknown-noun-- affinity --unk_noun--
13240 --unk-- --unknown-verb-- patriarchate --unk_verb--
13438 --unk-- --unknown-noun-- underselling --unk_noun--
13650 --unk-- --unknown-adjective-- wrathful --unk_adj--
13725 --unk-- --unknown-noun-- gist --unk_noun--
14081 --unk-- --unknown-noun-- segmentation --unk_noun--
14110 --unk-- --unknown-adjective-- brightly --unk_adj--
15331 --unk-- --unknown-noun-- connector --unk_noun--
17846 --unk-- --unknown-noun-- readjustment --unk_noun--
18397 --unk-- --unknown-noun-- observation --unk_noun--
18410 --unk-- --unknown-noun-- ticker --unk_noun--
18566 --unk-- --unknown-noun-- trickery --unk_noun--
18750 --unk-- --unknown-adjective-- supersonic --unk_adj--
18854 --unk-- --unknown-noun-- existance --unk_noun--
18885 --unk-- --unknown-adjective-- thankfully --unk_adj--
19011 --unk-- --unknown-noun-- coherence --unk_noun--
19304 --unk-- --unknown-adjective-- autocratic --unk_adj--
19305 --unk-- --unknown-noun-- pseudosocialism --unk_noun--
19326 --unk-- --unknown-noun-- encircling --unk_noun--
19389 --unk-- --unknown-noun-- miscegenation --unk_noun--
19470 --unk-- --unknown-adjective-- ostensible --unk_adj--
19479 --unk-- --unknown-adjective-- purportedly --unk_adj--
19554 --unk-- --unknown-noun-- accuser --unk_noun--
19568 --unk-- --unknown-noun-- embezzler --unk_noun--
19961 --unk-- --unknown-adjective-- unwittingly --unk_adj--
19970 --unk-- --unknown-noun-- platter --unk_noun--
20129 --unk-- --unknown-noun-- centrist --unk_noun--
20384 --unk-- --unknown-adjective-- improbable --unk_adj--
20472 --unk-- --unknown-adjective-- glaringly --unk_adj--
20493 --unk-- --unknown-noun-- clarity --unk_noun--
20496 --unk-- --unknown-noun-- rectification --unk_noun--
20539 --unk-- --unknown-noun-- wiser --unk_noun--
21215 --unk-- --unknown-adjective-- concurrently --unk_adj--
21310 --unk-- --unknown-verb-- revolutionize --unk_verb--
22257 --unk-- --unknown-noun-- compensatory --unk_noun--
22270 --unk-- --unknown-noun-- respiratory --unk_noun--
23603 --unk-- --unknown-noun-- milion --unk_noun--
23928 --unk-- --unknown-noun-- poultry --unk_noun--
23947 --unk-- --unknown-noun-- cessation --unk_noun--
24005 --unk-- --unknown-noun-- mothballing --unk_noun--
24168 --unk-- --unknown-noun-- synthesizer --unk_noun--
24195 --unk-- --unknown-adjective-- distinctly --unk_adj--
24280 --unk-- --unknown-noun-- synthesizer --unk_noun--
24293 --unk-- --unknown-adjective-- robotic --unk_adj--
24294 --unk-- --unknown-noun-- flatness --unk_noun--
24861 --unk-- --unknown-noun-- carnage --unk_noun--
25248 --unk-- --unknown-adjective-- frantic --unk_adj--
25252 --unk-- --unknown-noun-- hammer --unk_noun--
26001 --unk-- --unknown-noun-- whisper --unk_noun--
27468 --unk-- --unknown-noun-- prophecy --unk_noun--
27538 --unk-- --unknown-noun-- encircling --unk_noun--
27716 --unk-- --unknown-verb-- realestate --unk_verb--
27994 --unk-- --unknown-noun-- insolvency --unk_noun--
28110 --unk-- --unknown-adjective-- forceful --unk_adj--
28195 --unk-- --unknown-adjective-- zealous --unk_adj--
28485 --unk-- --unknown-adjective-- belatedly --unk_adj--
29370 --unk-- --unknown-verb-- duplicate --unk_verb--
29902 --unk-- --unknown-adjective-- reptilian --unk_adj--
30078 --unk-- --unknown-noun-- industrialization --unk_noun--
31292 --unk-- --unknown-adjective-- vociferous --unk_adj--
31303 --unk-- --unknown-adjective-- powerless --unk_adj--
31549 --unk-- --unknown-noun-- provocation --unk_noun--
31648 --unk-- --unknown-adjective-- archaic --unk_adj--
31700 --unk-- --unknown-noun-- lament --unk_noun--
32149 --unk-- --unknown-adjective-- tantalizingly --unk_adj--
32393 --unk-- --unknown-noun-- hammer --unk_noun--
33208 --unk-- --unknown-adjective-- defiantly --unk_adj--
33238 --unk-- --unknown-noun-- rickety --unk_noun--
33280 --unk-- --unknown-noun-- unionist --unk_noun--
33336 --unk-- --unknown-noun-- dapper --unk_noun--
33721 --unk-- --unknown-adjective-- repressive --unk_adj--
33832 --unk-- --unknown-noun-- disillusionment --unk_noun--
33861 --unk-- --unknown-noun-- agitation --unk_noun--
#+end_example

#+begin_src python :results output :exports both
for word in (line for line in loader.vocabulary_words if line.startswith("--u")):
    print(word)
#+end_src

#+RESULTS:
: --unknown--
: --unknown-adjective--
: --unknown-adverb--
: --unknown-digit--
: --unknown-noun--
: --unknown-punctuation--
: --unknown-uppercase--
: --unknown-verb--
